# Задача 1

# Написать программу, которая запрашивает у пользователя произвольную строку и выводит на экран ее длину.

a = input()
print(len(a))
